//-----------------------ES6-----------------------//


//1. Variables: let, const
//let x =10;
//x=20;
//const y = 30; //can't reassign
//------------------------------------------------
//2. Arrow function
// const sum = (a, b) => a + b; //упускаємо return
//
// const diff = (a, b) => {
//     return a - b;
// };
// console.log(5, 3);
//-------------------------------------------------
//3. КЛАСИ
//-------------------------------------------------
//4. Template literals
// ~ рядкові літерали які дозволяють вбудовані вирази
// ~ підтримка багаторядкових рядків без конкатенації
//-------------------------------------------------
//5. Enchances Object Literals
// - скорочені назви властивостей
// - скорочені назви методів
// - імена властивостей з виразів
//-------------------------------------------------
// 6. Destructuring (деструктуризація)
//  - витягування значеннь з масивів та об*єктів з перепризначенням змінних
// const { prop1, prop2 } = obj; (деструктуризація об*єкта)
// const [item1, item2] = array; (деструктуризація масивів)
//  - можна використовувати з праметрами ф-ції
//-------------------------------------------------
// 7. Default Paramets
// function greet(name = "Guest") {
//     console.log(`Hello, ${name}`);
// };
// greet();
//-------------------------------------------------
// 8. Rest Parametrs
// - можливість приймати невизначену к-сть параметрів
// function sum(...numbers) {
//     return numbers.reduce((acc, num) => acc + num, 0);
// }
// console.log(sum(1, 2, 3, 4));
//-------------------------------------------------
// 9. Spread Operator
// - розширює ітерацію на окремі елементи
// -  використовується для:
// 1 - створення поверхневих копій масивів та об*єктів
// 2 - об*єднання масивів
// 3 - передача кількох аргументів ф-ції
//-------------------------------------------------
// 10. for...of Loop
// - перебирає об*єкти, які ітеруються (масиви, рядки, тощо)
//-------------------------------------------------
// 11. Symbols
// - новий примітивний тип даних
//-------------------------------------------------
// 12. Ітератори та генератори
// *Ітератори - об*єктиБ які визначають чергу і спосіб доступу до неї
// *Генератори - функції, які можна призупинити та відновити
//-------------------------------------------------
// 13. Map and Set
// *Map - набір пар ключ-значення
// *Set - колекція унікальних значень
//-------------------------------------------------
// 14. Promises (Example with async/await later)
// const myPromise = new Promise((resolve, reject) => {
//     setTimeout(() => resolve("Promise Resolved1"), 500);
// });
// myPromise.then(result => console.log("Promise then: ", result));
// - об*єкти що представляють остаточне завершення (або невдачу) асинхронної операції
// - читабельніше альтернатива колбєкам
//-------------------------------------------------
// 15. Modules - вимагає модульної системи
//-------------------------------------------------
// 16. Proxies
// - об*єкти які дозволяють перехоплювати та налаштовувати опрерації з іншими об*єктами
//-------------------------------------------------
// 17. Typed Array - масиви, які місять значення певного числового типу
//---------------------------------------------------------------------------------------------------------------------

//-----------------------ES7 (НОВА ВЕРСІЯ 2016)-----------------------//
// 19. Array.prototype.includes
// - перевіряє ТІЛЬКИ прості значення
// console.log("Includes", arr.includes(2));
//-------------------------------------------------
// 20. Exponentiation operator
// console.log("Exp. operator", 2 ** 3);
//-------------------------------------------------


//-----------------------ES8 (НОВА ВЕРСІЯ 2017)-----------------------//
// 21. async/ await
// - синтаксичний цукор для роботи з
// промісами, що полегшує читання та написання асинхронного коду
// - ДОЧІКУЄТЬСЯ НА РЕЗУЛЬТАТ
// - async - завжди повертає проміс
// - await - призупиняє виконання ф-ції доки не буде виконано проміс
// async function myAcyncFunctoin() {
//     const result = await myPromise;
//     console.log("Async/Await: ", result);
// };
// myAcyncFunctoin();
//-------------------------------------------------
// 22. Object.enties(), object.values(), object.keys()
//  Object.enties() - повертає масиви з параметрами, ключ-значення
//  object.values() - повертає значення
//  object.keys() - повертає ключі
//-------------------------------------------------
// 23. String.prototype.padStart() - доповнення початку рядка
//     String.prototype.padEnd() - доповнення кінця рядка
//-------------------------------------------------


//-----------------------ES9 (НОВА ВЕРСІЯ 2018)-----------------------//
// 24. Rest/Spread properties for Objects
//     => можливість розширяти об*єкти
//-------------------------------------------------
// 25. Promise.prototype.finally()
// - метод який завжди виконується, незалежно від того, вирішується чи відхиляється проміс
// - корисно для завдань з очищення змінних та стеку
// myPromise
//     .then(() => console.log("Promise finished"))
//     .finally(() => console.log("Promise cleanup"));
//-------------------------------------------------
// 26. Assynchronous Iteration
//     => дозволяє використовувати await у циклах for...await...of для повторених інтерованих об*єктів
//-------------------------------------------------


//-----------------------ES10 (НОВА ВЕРСІЯ 2019)-----------------------//
// 28. Array.prototype.flat(), Array.prototype.flatMap()
// - flat() - створює новий масив з усіма елементами підмасиву
// - flatMap() - зіставляє кожен елемент за допомогою ф-ції відображення
//-------------------------------------------------
// 29. String.prototype.trimStart(), String.prototype.trimEnd() - видаляє як початок так і кінець речення, де є пусте місце
//-------------------------------------------------
// 30. Object.fromEntries() - із масивів робить об*єкт
//-------------------------------------------------
// 31. Optional catch binding - спрощення синтаксису catch-a
//-------------------------------------------------


//-----------------------ES11 (НОВА ВЕРСІЯ 2020)-----------------------//
// 33. BigInt
//     => дозволяє оперувати великим числами
//-------------------------------------------------
// 34. Nullish Coalescing Operator (||, ??)
//     => повертає правий операнд якщо ліва частина дорівнює null або undefined
//-------------------------------------------------
// 35. Optional Chaining Operatop
//     => дозволяє безпечно дістатись до властивості
//-------------------------------------------------
// 36. Dynamic Import (потрібна підтримка модулів)
//-------------------------------------------------
// 37. GlobalThis - дізнатися де виконується код (спосіб доступу до глобального об*єкта)
//-------------------------------------------------
// 38. String.prototype.replaceAll() - спосіб зміни конкретного значення на інше
//-------------------------------------------------


//-----------------------ES12 (НОВА ВЕРСІЯ 2021)-----------------------//
// 39. Numeric Separator
//-------------------------------------------------
// 40. Promise.any() - виконується, коли будь-який проміс повернув результат
//-------------------------------------------------
// 41. Logical Assignment operatop - перевіряє лише значення null або undefined (??)
//-------------------------------------------------


//-----------------------ES13 (НОВА ВЕРСІЯ 2022)-----------------------//
// 42. Top-level Await - можна запускати await-и асинхронно
//-------------------------------------------------
// 43. Class Static Block
//-------------------------------------------------
// 44. .at() Method
//-------------------------------------------------
// 45. Error Cause
//-------------------------------------------------
// 46. Object.hasOwn() - перевірка чи є у об*єкта параметр з певним значенням